function solve(input) {
    let n = Number(input.shift());
    let output = '';
    for (let i = 1111; i <= 9999; i++) {
        let curNumber = i;

        let isMagick = true;
        while (curNumber > 0) {
            let lastDigit = curNumber % 10;
            if (n % lastDigit !== 0) {
                isMagick = false;
                break;
            }
            curNumber = Math.trunc(curNumber/10);
        }
        if (isMagick) {
            output+= i + ' ';
        }
    }
    console.log(output);
}
solve(
    ['3']
);

// 100/100
/*
Да се напише програма, която чете едно цяло число N, въведено от потребителя  и генерира всички възможни “специални” числа от 1111 до 9999. За да бъде “специалнo” едно число, то трябва да отговаря на следното условие: 
•	N да се дели на всяка една от неговите цифри без остатък.
Пример: при N = 16, 2418 е специално число:
•	16 / 2 = 8 без остатък
•	16 / 4 = 4 без остатък
•	16 / 1 = 16 без остатък
•	16 / 8 = 2 без остатък
Вход
Входът се чете от конзолата и се състои от едно цяло число в интервала [1…600000]
Изход
На конзолата трябва да се отпечатат всички “специални” числа, разделени с интервал


*/